{
  "navigation": {
    "home": "Головна",
    "about": "Про мене",
    "portfolio": "Портфоліо",
    "contact": "Контакти"
  },
  "intro": {
    "greeting": "Вітаю,",
    "name": "Я Валерій",
    "surname": "Литвин",
    "sloganPartOne": "Інноваційні веб-рішення",
    "sloganPartTwo": "з React",
    "viewProjects": "Переглянути проєкти",
    "contactMe": "Зв'язатися зі мною",
    "tagline": "Прості рішення для складних задач!"
  },
  "skills": {
    "title": "У своїх проєктах я використовую:"
  },
  "about": {
    "title": "Хто я?",
    "tagline": "Перетворюю ідеї на адаптивні додатки!",
    "descriptionPartOne": "Я розробник React, створюю сучасні, адаптивні та зручні веб-додатки. Я спеціалізуюся на розробці динамічних рішень з використанням React, Redux і Next.js, а також JavaScript, TypeScript, HTML і CSS. Моя мета — писати чистий, підтримуваний код і створювати сайти, які виглядають чудово та бездоганно працюють на будь-яких пристроях.",
    "descriptionPartTwo": "Маю технічну освіту та вмію розбивати складні задачі на керовані рішення. Я завжди шукаю ефективні способи вирішення проблем та постійно навчаюся новим інструментам і технікам, щоб покращувати свою роботу та бути в курсі трендів галузі.",
    "descriptionPartThree": "Я ціную відкриту та прозору комунікацію, чесність і високу відповідальність. Моя мета — завжди дотримуватись дедлайнів і перевершувати очікування клієнтів. Незалежно від того, чи це створення нового сайту з нуля, чи вдосконалення існуючого проєкту, я завжди прагну досягти успіху в кожній задачі. Якщо ви шукаєте надійного та досвідченого розробника, який допоможе втілити ваші ідеї в життя, буду радий співпрацювати!"
  },
  "portfolio": {
    "title": "Мої проєкти.",
    "moreLink": "Детальніше про проєкт",
    "linkToPage": "Посилання на сторінку",
    "viewLink": "Переглянути проєкт",
    "projectImage": "Зображення проєкту:",
    "errorLoadingImage": "Помилка завантаження зображення"
  },
  "contact": {
    "title": "Будьмо на зв'язку.",
    "tagline": "Давайте втілимо ваші ідеї в життя!",
    "descriptionPartOne": "Є мрія, задача чи план?",
    "descriptionPartTwo": "Разом досягнемо успіху!",
    "submitButton": {
      "submit": "Надіслати",
      "sending": "Надсилання...",
      "submitted": "Повідомлення надіслано"
    },
    "form": {
      "namePlaceholder": "Введіть вашу електронну адресу або Telegram",
      "messagePlaceholder": "Введіть повідомлення",
      "captchaQuestion": "Скільки дорівнює",
      "captchaPlaceholder": "Будь ласка, введіть відповідь",
      "captchaError": "Неправильна відповідь. Повторіть спробу."
    },
    "error": {
      "fetchError": "Сталася невідома помилка.",
      "responseError": "Не вдалося надіслати:"
    }
  },
  "footer": {
    "copyright": "© Авторське право 2025",
    "location": {
      "title": "Контактна інформація:",
      "address": "Одеса, Україна",
      "phone": "Телефон:",
      "phoneLabel": "Telephone number",
      "email": "Електронна пошта:",
      "emailLabel": "Адреса електронної пошти"
    }
  },
  "errorPage": {
    "title": "ЙоЙ!",
    "subtitle": "Вибачте, сталася неочікувана помилка.",
    "backToHome": "Повернутися на головну"
  },
  "project": {
    "linkToPage": "Посилання на сторінку",
    "viewProjectLink": "Переглянути проєкт",
    "viewRepositoryLink": "Переглянути репозиторій",
    "keyFeatures": "Основні характеристики:",
    "technologiesUsed": "Використані технології",
    "conclusion": "Висновок:"
  },
  "imageAlt": "Фоновий візерунок",
  "projects": {
    "kolyskaShop": {
      "description": "Kolyska Shop — це професійний проєкт, що демонструє мою здатність створювати адаптивний інтернет-магазин із передовими функціями, такими як управління станом, маршрутизація та ледаче завантаження. Він відображає мій досвід у створенні зручних інтерфейсів із плавними анімаціями та високою продуктивністю.",
      "features": {
        "dynamicContent": {
          "title": "Динамічний контент",
          "details": "Реалізовано динамічну обробку даних та ледаче завантаження для покращення продуктивності та плавного користувацького досвіду."
        },
        "responsiveDesign": {
          "title": "Адаптивний дизайн",
          "details": "Вебсайт забезпечує безшовний досвід покупок на різних пристроях, гарантуючи сумісність із екранами будь-якого розміру."
        },
        "stateManagement": {
          "title": "Управління станом",
          "details": "Використано Redux Toolkit для ефективного управління станом, забезпечуючи надійне та масштабоване рішення для роботи з даними."
        },
        "routingCapabilities": {
          "title": "Можливості маршрутизації",
          "details": "Інтегровано React Router для навігації між сторінками та прокрутки по хешу для швидкого доступу до певних розділів."
        },
        "interactiveAnimations": {
          "title": "Інтерактивні анімації",
          "details": "Framer Motion використовується для створення плавних анімацій, що підвищують візуальну привабливість і інтерактивність сайту."
        },
        "userEngagement": {
          "title": "Залучення користувачів",
          "details": "Додано функції, такі як сповіщення (React Toastify) і інтерактивні індикатори завантаження, щоб тримати користувачів у курсі та зацікавленими."
        }
      },
      "conclusion": "Kolyska Shop демонструє мою здатність створювати функціональні та привабливі інтернет-магазини за допомогою сучасних вебтехнологій. Він підкреслює мої навички у створенні адаптивного дизайну, анімацій, управління станом та оптимізації продуктивності застосунків."
    },
    "garage": {
      "description": "Garage — це особистий проект, який демонструє мою здатність створювати візуально привабливі й функціональні front-end додатки. Він акцентує увагу на інтерактивному дизайні, маршрутизації й плавній анімації.",
      "features": {
        "dynamicContent": {
          "title": "Динамічний контент",
          "details": "Проект включає динамічне завантаження контенту й ліниве завантаження зображень для оптимальної продуктивності."
        },
        "responsiveDesign": {
          "title": "Адаптивний дизайн",
          "details": "Макет повністю адаптивний, забезпечуючи зручний досвід на пристроях різних розмірів — від мобільних до настільних."
        },
        "interactiveAnimations": {
          "title": "Інтерактивні анімації",
          "details": "Плавні переходи й ефекти руху покращують користувацький досвід, створюючи привабливий інтерфейс."
        },
        "routingCapabilities": {
          "title": "Можливості маршрутизації",
          "details": "Використовується React Router для реалізації навігації між різними секціями додатка."
        }
      },
      "conclusion": "Цей проект демонструє мою експертність у сучасній front-end розробці, включаючи адаптивний дизайн, анімації та компонентну архітектуру. Він відображає мою здатність створенню зручних і візуально привабливих додатків."
    },
    "estateAgency": {
      "description": "Estate Agency App — це платформа для нерухомості, розроблена для демонстрації об'єктів із зручним і візуально привабливим інтерфейсом. Цей проект підкреслює мою здатність створення динамічних, адаптивних веб додатків із інтерактивними функціями.",
      "features": {
        "responsiveDesign": {
          "title": "Адаптивний дизайн",
          "details": "Додаток забезпечує оптимальний користувацький досвід на всіх пристроях, адаптуючись від мобільних до настільних екранів."
        },
        "interactiveAnimations": {
          "title": "Інтерактивні анімації",
          "details": "Інтегровані з Framer Motion для забезпечення плавних анімацій і переходів, покращуючи загальний користувацький досвід."
        },
        "carouselFunctionality": {
          "title": "Функціонал каруселі",
          "details": "Використовується Swiper.js для стильних інтерактивних каруселей, які ефективно відображають зображення об'єктів."
        },
        "modernFramework": {
          "title": "Сучасний фреймворк",
          "details": "Розроблено на базі Next.js для досягнення високої продуктивності, серверного рендерингу та оптимізації для SEO."
        }
      },
      "conclusion": "Цей проект підкреслює мою здатність створювати функціональні й орієнтовані на користувача вебсайти для агентств нерухомості. Я готовий застосовувати ці навички в майбутніх проєктах."
    },
    "restaurantLGRAN": {
      "description": "Landing Page ресторану — це візуально привабливий вебсайт, розроблений для залучення й утримання клієнтів. Він демонструє мою здатність створювати адаптивні, оптимізовані для продуктивності та естетично привабливі веб додатки.",
      "features": {
        "modernDesign": {
          "title": "Сучасний дизайн",
          "details": "Landing Page має чистий, сучасний дизайн із високоякісними візуальними елементами для покращення взаємодії з користувачами та ефективної демонстрації бренду ресторану."
        },
        "responsiveLayout": {
          "title": "Адаптивний макет",
          "details": "Макет повністю адаптивний, забезпечуючи відмінний вигляд на пристроях різних розмірів, від мобільних до настільних."
        },
        "smoothAnimations": {
          "title": "Плавні анімації",
          "details": "Framer Motion використовується для створення плавних переходів і привабливих інтерактивних елементів."
        },
        "lazyLoading": {
          "title": "Ліниве завантаження",
          "details": "Реалізовано ліниве завантаження зображень для покращення продуктивності та зменшення часу завантаження."
        },
        "iconIntegration": {
          "title": "Інтеграція іконок",
          "details": "Підвищено візуальну привабливість завдяки React Icons для інтуїтивного та елегантного дизайну."
        },
        "optimizedPerformance": {
          "title": "Оптимізована продуктивність",
          "details": "Розроблено на базі Vite та Tailwind CSS, що забезпечує швидкодію та легкість у підтримці коду."
        }
      },
      "conclusion": "Цей проект підкреслює мої навички у створенні візуально привабливих, адаптивних і зручних для користувача веб додатків. Він демонструє мою увагу до якості дизайну, оптимізованого для продуктивності та зручності."
    },
    "eCommerce": {
      "description": "Shop App - це потужна платформа для електронної комерції, створена для забезпечення плавного та інтуїтивно зрозумілого шопінгу. Цей проєкт демонструє мої знання у керуванні станом, адаптивному дизайні та інтеграції сторонніх сервісів.",
      "features": {
        "comprehensiveEcommerceFeatures": {
          "title": "Широкі можливості електронної комерції",
          "details": "Містить повністю функціональний кошик, автентифікацію користувачів та фільтрацію продуктів. Користувачі можуть додавати товари до кошика, переглядати категорії продуктів та безпечно здійснювати транзакції."
        },
        "stateManagementWithReduxToolkit": {
          "title": "Керування станом за допомогою Redux Toolkit",
          "details": "Використовує Redux Toolkit для ефективного керування станом, забезпечуючи плавну роботу та масштабованість додатку."
        },
        "userAuthentication": {
          "title": "Автентифікація користувачів",
          "details": "Інтегровано Firebase для безпечної автентифікації користувачів, що дозволяє реєструватися, входити в систему та керувати обліковими записами."
        },
        "toastNotifications": {
          "title": "Сповіщення Toast",
          "details": "Включає React Toastify для елегантних та адаптивних сповіщень, що покращують взаємодію з користувачем."
        },
        "responsiveUI": {
          "title": "Адаптивний інтерфейс користувача",
          "details": "Розроблений за допомогою Bootstrap і  стилів Sass, щоб забезпечити сучасний адаптивний дизайн, який ідеально підходить для будь-яких пристроїв."
        },
        "formValidation": {
          "title": "Валідація форм",
          "details": "Реалізовано надійну валідацію форм за допомогою бібліотеки Validator, щоб покращити точність даних і запобігти помилкам."
        },
        "persistentData": {
          "title": "Стійкі дані",
          "details": "Забезпечено збереження кошика та даних користувачів за допомогою Redux Persist, щоб гарантувати постійний доступ до даних у різних сесіях."
        }
      },
      "conclusion": "Цей проєкт відображає мою здатність створювати передові платформи для електронної комерції з безпечною автентифікацією, керуванням станом і адаптивним дизайном. Він демонструє мою відданість створенню високоякісних, орієнтованих на користувача додатків, оптимізованих для продуктивності та масштабованості."
    },
    "gymClub": {
      "description": "Вебсайт Gym Club - це візуально приваблива і зручна платформа, створена для просування послуг та інфраструктури тренажерного залу. Він демонструє мої навички у створенні адаптивного дизайну, інтеграції форм і сучасних практик веб-розробки.",
      "features": {
        "modernLandingPage": {
          "title": "Сучасна лендинг-сторінка",
          "details": "Має стильний і професійний дизайн, який ефективно висвітлює послуги тренажерного залу, варіанти членства та інфраструктуру."
        },
        "responsiveDesign": {
          "title": "Адаптивний дизайн",
          "details": "Розроблений за допомогою Bootstrap і Sass, щоб забезпечити відмінний вигляд і бездоганну роботу на всіх пристроях."
        },
        "iconIntegration": {
          "title": "Інтеграція іконок",
          "details": "Використовує React Icons для інтуїтивно зрозумілих і візуально привабливих елементів дизайну, покращуючи навігацію та взаємодію користувачів."
        },
        "optimizedStyling": {
          "title": "Оптимізоване стилізація",
          "details": "Застосовано Normalize.css для забезпечення консистентного стилю у різних браузерах і покращення загальної зручності."
        },
        "lightweightPerformance": {
          "title": "Легка продуктивність",
          "details": "Розроблено з використанням React і оптимізованих ресурсів для забезпечення швидкого завантаження і плавної взаємодії."
        },
        "conclusion": "Цей проєкт демонструє мою експертизу у створенні привабливих, адаптивних та функціональних вебсайтів. Він ілюструє мою здатність інтегрувати сторонні сервіси та створювати платформи, що відповідають потребам користувачів і бізнесу."
      }
    },
    "travelAgency": {
      "description": "Вебсайт Travel Agency - це візуально приваблива платформа, створена для демонстрації туристичних пакетів і надихання клієнтів на нові подорожі. Цей проєкт демонструє мої навички у створенні динамічних, інтерактивних і зручних вебсайтів.",
      "features": {
        "interactiveUserExperience": {
          "title": "Інтерактивний користувацький досвід",
          "details": "Включає плавні анімації за допомогою Framer Motion і інтерактивні каруселі зі Swiper для   зручного перегляду."
        },
        "videoIntegration": {
          "title": "Інтеграція відео",
          "details": "Інтегровано вбудовування відео з YouTube, щоб надати багатший і більш привабливий вигляд ."
        },
        "responsiveDesign": {
          "title": "Адаптивний дизайн",
          "details": "Розроблено за допомогою Sass і сучасних практик дизайну для забезпечення сумісності та оптимальної роботи на всіх пристроях."
        },
        "lazyLoading": {
          "title": "Оптимізація завантаження",
          "details": "Використовує React Lazy Load Image Component для оптимізації часу завантаження і підвищення продуктивності."
        },
        "routerNavigation": {
          "title": "Навігація за допомогою маршрутизатора",
          "details": "Реалізовано з React Router DOM для плавної навігації між сторінками і зручного користувацького досвіду."
        }
      },
      "conclusion": "Цей проєкт демонструє мою здатність створювати захопливі та функціональні вебсайти для бізнесу. Він ілюструє мої навички в інтеграції динамічних функцій, оптимізації продуктивності та створенні виняткового користувацького досвіду."
    },
    "arithmetic": {
      "description": "Гра «Arithmetic» — це  інтерактивна платформа, створена для того, щоб діти могли практикувати базові математичні навички у веселій та цікавій формі. Цей проєкт підкреслює мою здатність створювати освітні та розважальні додатки з акцентом на простоту та залучення користувачів.",
      "features": {
        "engagingGameplay": {
          "title": "Приємний ігровий процес",
          "details": "Прості арифметичні вправи, створені для того, щоб зробити вивчення математики цікавим та інтерактивним для дітей."
        },
        "celebratoryAnimations": {
          "title": "Анімації нагородження",
          "details": "Містить анімації конфеті за допомогою React Confetti, які заохочують правильні відповіді та мотивують гравців."
        },
        "statePersistence": {
          "title": "Збереження стану",
          "details": "Використовує Redux Toolkit і Redux Persist для збереження прогресу гри та налаштувань між сесіями, забезпечуючи безперервність і зручність для користувачів."
        },
        "childFriendlyDesign": {
          "title": "Дизайн для дітей",
          "details": "Створено за допомогою Bootstrap та Sass для створення яскравого та інтуїтивно зрозумілого інтерфейсу, адаптованого для молодих користувачів."
        },
        "navigationSystem": {
          "title": "Система навігації",
          "details": "Використовує React Router DOM для плавної навігації між рівнями гри та налаштуваннями."
        }
      },
      "conclusion": "Цей проєкт демонструє мою здатність створювати інтерактивні додатки з орієнтацією на користувача. Поєднуючи освітній контент із красивим дизайном, я створив гру, яка допомагає дітям вивчати математику із задоволенням."
    },
    "weatherApp": {
      "description": "Додаток «Погода» — це зручний додаток, розроблений для надання актуальних прогнозів погоди. Він має прості та інтуїтивно зрозумілі функції, які допомагають користувачам легко перевіряти погоду у вибраних місцях. Цей проєкт демонструє мою здатність створювати адаптивні та функціональні додатки з використанням сучасних технологій.",
      "features": {
        "realTimeWeatherData": {
          "title": "Актуальні дані про погоду",
          "details": "Отримує інформацію про погоду з API, щоб надавати актуальні та точні прогнози для будь-якого місця."
        },
        "responsiveLayout": {
          "title": "Адаптивний макет",
          "details": "Використовує Tailwind CSS для створення адаптивного та візуально привабливого макету, забезпечуючи відмінний вигляд додатка на мобільних і настільних пристроях."
        },
        "loadingIndicators": {
          "title": "Індикатори завантаження",
          "details": "Має плавні анімації завантаження за допомогою React Spinners, забезпечуючи безперервний користувацький досвід під час очікування завантаження даних."
        },
        "navigationSystem": {
          "title": "Система навігації",
          "details": "Використовує React Router DOM для плавних переходів між різними виглядами та розділами додатка."
        }
      },
      "conclusion": "Цей додаток «Погода» демонструє мою здатність створювати інтерактивні та адаптивні додатки. Він підкреслює мої навички в інтеграції API, отриманні даних у реальному часі та створенні зручного інтерфейсу."
    }
  }
}
